-- SEEED DOCTORS 

INSERT INTO TABLE 
Doctors (doc_code, doc_last_name, doc_first_name, doc_phone_num, doc_city, doc_salary, d_Special_code)
VALUES 
(10, 'ריף', 'שמחה', '0505757575', 'תל אביב', 22320, 3),
(20, 'חגג', 'יום טוב', '0523453453', 'חיפה', 17400, 3),
(30, 'ימינה', 'פנינה', '05289898989', 'תל אביב', 14700, 4),
(40, 'תאיר', 'מאיר', '0549234567', 'חיפה', 24660, 1),
(50, 'מדינה', 'מאיר', '0528234567', 'ירושלים', 22320, 1),
(60, 'מערבי', 'גל', '0543333777', 'תל אביב', 24660, 3)
;



INSERT INTO TABLE Patients 
(Patient_ID,
P_last_name,
p_first_name,
p_gender,
p_phone_num,
p_city ) VALUES
( 100, 'כהן', 'אברהם', 'זכר', '0501234567', 'תל אביב'),
( 200, 'לוי', 'בת', 'נקבה', '0501234567', 'חיפה'),
( 300, 'גולדברג', 'משה', 'זכר', '0501234567', 'חיפה'),
( 400, 'מרום', 'גלי', 'נקבה', '0501234567', 'חיפה'),
( 500, 'גולדברג', 'אהרון', 'זכר', '0501234567', 'חיפה'),
( 600, 'נילי', 'שרה', 'נקבה', '0501234567', 'תל אביב'),
( 700, 'גולדברג', 'אביעד', 'זכר', '0501234567', 'ירושלים'),
( 800, 'חריש', 'שלי', 'נקבה', '0501234567', 'ירושלים'),
( 900, 'רבנו', 'משה', 'זכר', '0501234567', 'ירושלים'),
( 1000, 'אמנו', 'שרה', 'נקבה', '0501234567', 'תל אביב'),
( 1100, 'פרי', 'אהרון', 'זכר', '0501234567', 'תל אביב'),
( 1200, 'גולדברג', 'רבקה', 'נקבה', '0501234567', 'תל אביב')
;

INSERT INTO TABLE SpecialityType 
(Special_code,
Special_name,
Special_area
 ) VALUES 
( 1, 'אורתופדיה', 'הדסה עין כרם'),
(2, "כירורגיה", "תל השומר"),
(2, "משפחה", "תל השומר"),
(2, "ילדים", "איכילוב")
;

INSERT INTO TABLE MeetType
(meet_code,
description
 ) VALUES 
( 1, 'רגילה'),
(2, "חירום"),
(3, "טלפוני")
;

INSERT INTO TABLE Treatments
(doctor_code,
patient_id,
meet_date,
meet_code
) VALUES 
(10, 100, "1/9/2020", 2),
(10, 200, "17/9/2020", 2),
(20, 300, "30/12/2019", 3),
(20, 400, "25/05/2020", 3),
(30, 100, "21/11/2019", 2),
(30, 100, "17/7/2020", 2),
(30, 300, "25/5/2020", 3),
(30, 300, "17/09/2020", 1),